       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.
       AUTHOR.        Nikolaj R C
       PROCEDURE DIVISION.
           DISPLAY 'FIAT LUX!'.
           GOBACK.
