//FINDSHP JOB (ACCT),'FINDSHP',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//RUN EXEC PGM=FINDSHP,PARM='RNBB0029'
//*Link libraries
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//*User supplied data: allied ships
//VSAMFILE     DD DSN=&SYSUID..VSAM,DISP=SHR
//VSAMIN       DD DSN=&SYSUID..VSAM,DISP=SHR
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY