//GETSHP JOB (ACCT),'GETSHP',CLASS=A,MSGCLASS=A,NOTIFY=&SYSUID
//RUN EXEC PGM=LSSHP
//*Link libraries
//STEPLIB DD DSN=&SYSUID..LOAD,DISP=SHR
//*User supplied data: allied ships
//ALLSHPS   DD DSN=&SYSUID..USERDATA(ALLIED),DISP=SHR
//SYSOUT    DD SYSOUT=*,OUTLIM=15000
//CEEDUMP   DD DUMMY
//SYSUDUMP  DD DUMMY