//GETUID  JOB 1,NOTIFY=&SYSUID
//***************************************************/
//COBRUN  EXEC IGYWCL
//COBOL.SYSIN  DD DSN=&SYSUID..CBL(GETUID),DISP=SHR
//LKED.SYSLMOD DD DSN=&SYSUID..LOAD(GETUID),DISP=SHR
//*